import Header from '../components/shared/Header';
import Footer from '../components/shared/Footer';
import React from 'react'

const SiteRule = () => (
    <React.Fragment>
        <Header />
        <div>
            <h2>サイト規約</h2>
                <p>
                    この利用規約（以下，「本規約」といいます。）は，＿＿＿＿＿（以下，「当社」といいます。）が
                    このウェブサイト上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。
                    登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
                </p>
            <h3>第1条（適用）</h3>
                <p>
                    本規約は，ユーザーと当社との間の本サービスの利用に関わる一切の関係に適用されるものとします。
                    当社は本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）
                    をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
                    本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，
                    個別規定の規定が優先されるものとします。
                </p>
            <h3>第2条（利用登録）</h3>
                <p>
                本サービスにおいては，登録希望者が本規約に同意の上，当社の定める方法によって利用登録を申請し，
                当社がこの承認を登録希望者に通知することによって，利用登録が完了するものとします。
                当社は，利用登録の申請者に以下の事由があると判断した場合，利用登録の申請を承認しないことがあり，
                その理由については一切の開示義務を負わないものとします。
                <ul>
                    <li>利用登録の申請に際して虚偽の事項を届け出た場合</li>
                    <li>本規約に違反したことがある者からの申請である場合</li>
                    <li>その他，当社が利用登録を相当でないと判断した場合</li>
                </ul>
                </p>
        </div>
        <Footer />
        <style jsx>{`
            div {
                margin: 0 auto;
                width: 80%;
                height: 80%;
            }
        `}</style>
    </React.Fragment>
);

export default SiteRule;